# Создать декоратор с аргументами.
# Который будет вызывать функцию, определенное кол-во раз, 
# будет выводить кол-во времени затраченного на выполнение данной функции и ее название.

def my_decorator(func):
    value = 3
    



def my_func():

    print("How it possible?")