# 2) Создать базу данных студентов. У студента есть факультет, группа, оценки, номер студенческого билета. 
# Написать программу, с двумя ролями: Администратор, Пользователь. 
# Администратор может добавлять, изменять существующих студентов.
# Пользователь может получать список отличников, список всех
# студентов, искать студентов по по номеру студенческого, получать
# полную информацию о конкретном студенте (включая оценки, факультет)

import sqlite3

class Administrator():
    pass



class User():
    pass
